Tekla.Structures.Drawing.CannotLoadAttributesException
The CannotLoadAttributesException class defines the exception
that is thrown when the loading of attributes failed.

Tekla.Structures.Drawing.CannotLoadAttributesException.#ctor(System.String)
Creates a new cannot load attributes exception instance.
AttributeFile: The name of the attribute file that was being loaded.

Tekla.Structures.Drawing.CannotLoadAttributesException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.

Tekla.Structures.Drawing.CannotLoadAttributesException.AttributeFile
The name of the attribute file that was being loaded.